Repository: ruta54-create/inkingi_project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: rw

source: Home
rw: Ahabanza

source: Products
rw: Ibicuruzwa

source: All Products
rw: Ibicuruzwa Byose

source: Furniture
rw: Ibikoresho byo mu Nzu

source: Home & Office
rw: Inzu & Ibiro

source: Outdoor & Garden
rw: Hanze & Ubusitani

source: Doors & Construction
rw: Inzugi & Ubwubatsi

source: Handcrafted Products
rw: Ibicuruzwa by'Amaboko

source: Custom Made
rw: Bikorwa ku Giti Cyawe

source: Raw Materials
rw: Ibikoresho Bidahindutse

source: Kids & School
rw: Abana & Ishuri

source: Cart
rw: Agaseke

source: Search
rw: Shakisha

source: Dashboard
rw: Ikibaho

source: My Products
rw: Ibicuruzwa Byanjye

source: Orders
rw: Ibisabwa

source: My Orders
rw: Ibisabwa Byanjye

source: Profile
rw: Umwirondoro

source: Change password
rw: Hindura ijambo ry'ibanga

source: Logout
rw: Sohoka

source: Login
rw: Injira

source: About
rw: Ibyerekeye

source: Contact
rw: Twandikire

source: FAQ
rw: Ibibazo Bikunze Kubazwa

source: Add Product
rw: Ongeraho Igicuruzwa

source: Browse
rw: Reba

source: Sell on Inkingi Woods Ltd
rw: Gurisha kuri Inkingi Woods Ltd

source: Admin
rw: Ubuyobozi

source: Rwanda's premier marketplace for sustainable wood products, connecting artisans with global customers while preserving traditional craftsmanship.
rw: Isoko rikomeye ryo mu Rwanda ry'ibicuruzwa by'ibiti birambye, rihuza abahanga n'abakiriya ku isi hose mu kubungabunga ubuhanga bw'abasanzi.

source: Headquarters
rw: Icyicaro Gikuru

source: Quick Links
rw: Aho Ugera Vuba

source: About Us
rw: Ibyerekeye Twebwe

source: Become a Seller
rw: Ba Umucuruzi

source: Your Cart
rw: Agaseke Kawe

source: Contact Us
rw: Twandikire

source: Phone
rw: Telefone

source: Email
rw: Imeri

source: Chat with us
rw: Ganira Natwe

source: Connect With Us
rw: Duhurire

source: Business Hours
rw: Amasaha y'Akazi

source: Monday - Friday
rw: Kuwa Mbere - Kuwa Gatanu

source: Saturday
rw: Kuwa Gatandatu

source: Sunday
rw: Ku Cyumweru

source: Closed
rw: Birafunze

source: Get In Touch
rw: Twandikire

source: All rights reserved.
rw: Uburenganzira bwose bwabikiwe.

source: Privacy Policy
rw: Politiki y'Ibanga

source: Terms of Service
rw: Amategeko y'Imikorere

source: Refund Policy
rw: Politiki yo Gusubiza Amafaranga

source: Reset your password
rw: Hindura ijambo ry'ibanga ryawe

source: Email address
rw: Aderesi ya imeri

source: Send reset link
rw: Ohereza link yo guhindura

source: If your email exists in our system, you will receive a password reset link shortly.
rw: Niba imeri yawe iri muri sisitemu yacu, uzakira link yo guhindura ijambo ry'ibanga vuba.

source: Password reset requested
rw: Gusaba guhindura ijambo ry'ibanga

source: If your email exists, a reset link was sent.
rw: Niba imeri yawe ibaho, link yo guhindura yoherejwe.

source: Unable to send reset link right now. Please try again later.
rw: Ntibishoboka kohereza link yo guhindura ubu. Ongera ugerageze nyuma.

source: Success
rw: Byagenze Neza

source: Admin Dashboard
rw: Ikibaho cy'Ubuyobozi

source: Welcome to the Inkingi Woods administration panel
rw: Murakaza neza mu buyobozi bwa Inkingi Woods

source: Site Settings
rw: Igenamiterere rya Site

source: Total Revenue
rw: Amafaranga Yose

source: Today
rw: Uyu Munsi

source: Total Orders
rw: Ibisabwa Byose

source: Pending
rw: Bitegereje

source: Processing
rw: Birimo Gukorwa

source: Vendors
rw: Abacuruzi

source: Manage Vendors
rw: Gucunga Abacuruzi

source: Active
rw: Bikora

source: Quick Actions
rw: Ibikorwa Byihuse

source: Deliveries
rw: Ibigenewe Gutanga

source: Users
rw: Abakoresha

source: Currency
rw: Ifaranga

source: Settings
rw: Igenamiterere

source: Awaiting Confirmation
rw: Bitegereje Kwemezwa

source: Order
rw: Icyasabwe

source: Customer
rw: Umukiriya

source: Amount
rw: Ingano

source: Action
rw: Igikorwa

source: View
rw: Reba

source: No orders awaiting confirmation
rw: Nta bisabwa bitegereje kwemezwa

source: Recent Orders
rw: Ibisabwa bya Vuba

source: Vendor Management
rw: Gucunga Abacuruzi

source: View vendor performance and manage vendors
rw: Reba imikorere y'abacuruzi no kubacunga

source: Back to Dashboard
rw: Subira ku Kibaho

source: Vendor
rw: Umucuruzi

source: Total Sales
rw: Ibicuruzwa Byose

source: Joined
rw: Yinjiye

source: Actions
rw: Ibikorwa

source: No vendors found
rw: Nta bacuruzi babonetse

source: Pending Payment
rw: Kwishyura Bitegereje

source: Awaiting Vendor Confirmation
rw: Bitegereje Kwemezwa n'Umucuruzi

source: Shipped
rw: Byoherejwe

source: Delivered
rw: Byagejejwe

source: Completed
rw: Byarangiye

source: Cancelled
rw: Byahagaritswe

source: Upload Payment Proof
rw: Shyiraho Icyemezo cy'Ubwishyu

source: Payment Method
rw: Uburyo bwo Kwishyura

source: Bank Transfer
rw: Kohereza kuri Banki

source: Mobile Money
rw: Amafaranga kuri Telefone

source: Credit/Debit Card
rw: Ikarita ya Banki

source: Cash on Delivery
rw: Kwishyura Igihe Uhawe

source: Other
rw: Ibindi

source: Inactive
rw: Ntibikora

source: Standard Delivery (3-5 days)
rw: Kugeza Bisanzwe (Iminsi 3-5)

source: Express Delivery (1-2 days)
rw: Kugeza Byihuse (Iminsi 1-2)

source: Store Pickup
rw: Kuzifatira mu Iduka

source: Track Delivery
rw: Kurikirana Kugeza

source: Update Tracking
rw: Kuvugurura Aho Bigeze

source: English
rw: Icyongereza

source: Fran√ßais
rw: Igifaransa

source: Kinyarwanda
rw: Ikinyarwanda

source: Submit
rw: Ohereza

source: Cancel
rw: Hagarika

source: Save
rw: Bika

source: Delete
rw: Siba

source: Edit
rw: Hindura

source: Confirm
rw: Emeza

source: Reject
rw: Hakanisha

source: Accept
rw: Emera

source: Status
rw: Uko Bihagaze

source: Date
rw: Itariki

source: Price
rw: Igiciro

source: Quantity
rw: Ingano

source: Total
rw: Igiteranyo

source: Description
rw: Ibisobanuro

source: Name
rw: Izina

source: Stock
rw: Ibiri mu Bubiko

source: Category
rw: Icyiciro

source: Unit
rw: Igipimo

source: Image
rw: Ishusho
